{
	"Changes": [
		{ //Engagement Dialogue
		"Action": "EditData",
		"Target": "Data/EngagementDialogue",
		"Entries": {
			"Wizard0": "Words cannot express what it means to me to join hands with you.${{e6}}",
			"Wizard1": "Ever will I stand by your side.${{e1}}",
			},
		},

		{ //Marriage Dialogue
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated"},
        "Entries": {
            "Rainy_Day_Wizard": "{{Random: Today is the day I decipher the secret of drought and flood!${{e1}}#$e#Seek knowledge, seek answers. Have a wonderful day, my love.${{e7}} @@ Ah ha! The swelling energies have burst, and the rains come. Quickly! There is no time to lose.${{e7}}#$b#This is the best time to commune with certain elementals.${{e7}}#$e#Let's see... I will need... amethyst... black flame candles...${{e3}}#$b#Now where did I put that iridium?${{e3}} @@ Mmm, the air is heavy with magic. Can you feel it?${{e9}}#$e#Stay in with me, today. I'll give you another lesson in elementals.${{e6}}|inputSeparator=@@}}",
            "Rainy_Night_Wizard": "{{Random:Your clothes are soaked through... We must remove them from you immediately.#$e#So that you do not catch cold!${{e1}}#$b#I have no ulterior motives!${{e4}} @@ @, you are drenched!${{e2}}#$b#Just a moment. I have a spell...${{e7}}#$b#Ithikitalkus suh norn!${{e1}}#$b#There. Much better.${{e1}}#$e#...${{e3}}#$b#Drat. Why didn't I think to use wet clothes as an excuse before I dried them?${{e4}} @@ We'll both rest well tonight.${{e1}} |inputSeparator=@@}}",
            "Indoor_Day_Wizard": "{{Random: I entered this room in search of... something...${{e3}}#$e#What was it...?${{e3}} @@ Good morning, my heart.${{e6}}#$e#I believe I will try that spell of conjuring again, today.${{e7}}#$b#What do you have planned?${{e1}} @@ What a comfortable home we've made together on this farm! Much nicer than a drafty tower.${{e9}} |inputSeparator=@@}}",
            "Indoor_Night_Wizard": "{{Random:Ever glad am I to return to your side each night.${{e1}}#$e#You enchant me, @.${{e6}} @@ Welcome home, my heart. It has been a terribly long day in your absence.${{e6}}#$e#No, nothing in particular happened. I merely missed you.${{e1}} @@ Welcome home, @. I hope you didn't work yourself too hard today.${{e1}} |inputSeparator=@@}}",
            "Outdoor_Wizard": "{{Random: If a chicken and a half laid an egg and a half in a day and a half...${{e10}}#$e#How long did the orange peel lay on the floor...?${{e11}} @@ Your farm truly is extraordinary, @${{e3}}.#$b#Have you any idea how much attention you have attracted from across the veil?${{e1}}#$e#I need only stand here in the midst of it all to speak with them...${{e1}} @@ I've always preferred being outdoors to being cooped up inside. I find it limits one's view of the world too much.${{e1}} |inputSeparator=@@}}",
            "spring_Wizard": "{{Random: The energies of the earth are most potent this time of year. It is beneficial to focus my studies accordingly.${{e2}}#$e#If you would like, I might teach you more about the threads that tangle every life on your farm together.${{e1}} @@ I wish I could go back to the days of my youth for one more day. Go into the shop I always put off, talk to the librarians, learn even more.${{e3}}#$b#Those days are long gone, and all I have left of them is a shadow. Such is life. @@ Care to take a walk in the woods with me later? I can show you some useful plants you can find in spring.${{e1}}|inputSeparator=@@}}",
            "summer_Wizard": "{{Random: This heat is an affront to nature! Not even the elementals of fire could focus in such a stifling atmosphere${{e11}}#$e#I shall accomplish nothing until the sun sets.${{e11}} @@ Anger and hatred, they are false energies. They hide the real sources of power, which is understanding and sadness.#$b#It has become cliche, but it's true. I have learned so much, and it still holds true. Find peace before you tear yourself to pieces. @@ There's nothing like a summer breeze to soothe the soul. And truthfully, I enjoy thunderstorms, as well.#$e#All the exciting crackling in the air.${{e1}}#$b#It's one of the few things I can bring myself to tolerate about summer.${{e10}} |inputSeparator=@@}}",
            "winter_Wizard": "{{Random: The elementals of water encompass the world in an icy embrace. All that remains for us to do is reach out and touch them.#$e#Will you reach with me, @?${{e1}} @@ I feel drained today. Perhaps I should have remained in bed.${{e10}}#$e#The waning energies of this season do little for me.${{e11}} @@ During winter, I typically take the time to reinforce the town wards and then get to reading.#$e#I've barely made it through a quarter of the books in my tower...${{e3}}|inputSeparator=@@}}",
            "Rainy_Day_0": "{{Random: The air is heavy with energy, today.${{e1}}#$b#Remember: rain is merely a gift from the plane of water.${{e1}} @@ Ah ha! The swelling energies have burst, and the rains come. Quickly! There is no time to lose.${{e7}}#$b#This is the best time to commune with certain elementals.${{e7}}#$e#Let's see... I will need... amethyst... black flame candles...${{e3}}#$b#Now where did I put that iridium?${{e3}} @@ All this rain will be good for the crops, even if it's bad for my cape.${{e1}}|inputSeparator=@@}}",
            "Rainy_Day_1": "{{Random: Though a seed might hold all the potential for life, it is the rains that release it.${{e3}}#$b#Earth and water are as a lock and key.${{e1}} @@ The weather is perfect for a summoning ritual.${{e1}}#$b#The morning is best for it. I think that open patch outside...${{e3}}#$e#You don't need those crops, do you?${{e11}} @@ I know this may make me unusual, but rain puts me in a good mood.${{e1}}|inputSeparator=@@}}",
            "Rainy_Day_2": "{{Random: Ah! Gone is the glaring light of the sun!${{e1}}#$b#Today shall be a productive one. I hope to same for you, @.${{e7}} @@ Ah, excellent weather. I'll be busy today; the energies flow like a river, today. It would be a waste not to take advantage.${{e1}}#$b#Yes, outdoors. Where else would I do it?${{e3}}#$e#Hmm...? Yes, I will be soaked.${{e3}}#$b#You're welcome to handle that however you like, but only after I've completed my spell.${{e9}} @@ After dinner tonight, shall we light a nice fire and curl up in front of it?${{e1}}#$e#It wouldn't mind conjuring a long lasting fire just for us.${{e6}}|inputSeparator=@@}}",
            "Rainy_Day_3": "{{Random: This weather reminds me of a night I spent holed up in a rickety old miner's cabin in the middle of no where. Back when I was young and foolish, I would lose track of time and weather while absorbed in my work.${{e3}}#$b# I hardly noticed the storm until it was right on top of me, and the valley threatened to wash me away.${{e3}}#$b#Thankfully, I found the cabin before then. Even so, I feared all night that it would collapse on top of me.${{e1}}#$e#Hm? What do you mean I still lose track of things while working?${{e3}}#$b#I have no idea what you're talking about.${{e3}} @@ The elementals of water surround us. There is no time to waste!${{e1}}#$b#I will be hard at my work, this day.${{e1}} @@ The only criticism I have of robes is that they're irritatingly heavy when wet...${{e5}}|inputSeparator=@@}}",
            "Rainy_Day_4": "{{Random: Ah ha!${{e1}}#$b#This weather brings with it deep understanding of the relationship between the energies of the sky and air. I must write this down.${{e1}}#$e#Now where did I put my notebook?${{e3}}#$e#Stay in with me, today. I'll give you another lesson in elementals.${{e6}} @@ Were I a domestic husband, I would offer to make you a hot dinner after the day you will inevitably spend in this storm.#$b#But I'm not. You knew that before you married me, so I won't apologize.${{e10}}#$e#Unless you want burnt soup.${{e3}}#$b#Don't ask how - I would find a way to do it.${{e1}} |inputSeparator=@@}}",
            "Rainy_Night_0": "{{Random: Ah, @! You are utterly sodden!${{e1}}#$b#Come. Allow me to warm you.${{e6}} @@ There is something comfortable about being isolated here in the rain, with no one else around.${{e9}}#$e#Aren't you ready to come to bed?${{e6}} @@ The day after a rain like this, the forest is rejuvenated. Tomorrow morning, the trees will be splendid.${{e1}} |inputSeparator=@@}}",
            "Rainy_Night_1": "{{Random: I have heard that it is common in marriage for one to make the other a hot meal on a cold day's end.${{e3}}#$b#I fear my skills do not extend to that realm... but I found this in the fridge... [280 274 270 266 252 250]#$e#Perhaps you could make something and pretend I helped?${{e10}} @@ ...burnt smell?${{e3}}#$b#No, I don't smell anything.${{e11}}#$e#In all seriousness, I did warn you I could find a way to burn soup.${{e7}}#$b#Let us not speak of this again.${{e11}} @@ The sound of the rain on the roof is almost hypnotic, don't you think?${{e3}} |inputSeparator=@@}}",
            "Rainy_Night_2": "{{Random: On this stormy night, I ventured into the town for your benefit. I have acquired, from the saloon, something to warm you. [199 218 219 236]${{e3}}#$e#Perhaps we could pretend I made it?${{e1}} @@ @, you are drenched!${{e2}}#$b#Just a moment. I have a spell...${{e7}}#$b#Ithikitalkus suh norn!${{e1}}#$b#There. Much better.${{e1}}#$e#...${{e3}}#$b#Drat. Why didn't I think to use wet clothes as an excuse before I dried them?${{e4}} @@ I expended a great deal of mana today. A long rest will do me good.${{e9}}|inputSeparator=@@}}",
            "Rainy_Night_3": "{{Random: I see the rains have blessed your hair. It is a rare occurrence, indeed, that I am the better groomed between us.${{e7}} @@ The crackling of the fire is ever more inviting on a night like this.${{e9}}#$e#Sit with me awhile and watch the flames.${{e1}}#$b#I promise not to talk about elementals.${{e1}}#$b#...much.${{e7}} @@ Your crops will certainly be appreciative of this weather.${{e7}} |inputSeparator=@@}}",
            "Rainy_Night_4": "{{Random: @, @, @.${{e6}}#$b#The earth has caressed you with a touch of rain.${{e7}}#$e#You are truly magnificent.${{e6}} @@ Ah. Yes. Dinner.#$b#Well, you see, I tried a spell to create a magnificent feast, but magic is a funny thing, you know...${{e11}}#$e#I put out the fire before it spread.${{e11}}#$b#You probably can't even tell it was there.${{e10}} @@ I should go check on my tower's garden in the morning.#$e#Ancient fruit need more water than most other plants. It's possibly the reason they almost went extinct...${{e3}} |inputSeparator=@@}}",
            "Indoor_Day_0": "{{Random: Good morning, @, my heart. How did you sleep?${{e1}}#$e#Beside you, I always sleep well.${{e9}} @@ Good morning, my heart.${{e6}}#$e#I believe I will try that spell of conjuring again, today.${{e7}}#$b#What do you have planned?${{e1}} @@ I think I'll do a little cleaning today. ...You won't blame me too much if I use some magic to help it along, right?${{e3}}|inputSeparator=@@}}",
            "Indoor_Day_1": "{{Random: Today we continue your training. Have you been practicing, as I have showed you?${{e1}}#$e#Stand very still. You must forsake your ears listen with your mind.${{e1}}#$b#Only then will you truly understand the energies of the universe.${{e1}} @@ Ah, @. You're just in time. I have made you breakfast. [201 210 211 194 195]${{e1}}#$e#What do you mean you thought I couldn't cook? I'm insulted.${{e7}}#$e#...#$b#Alright, I bought it.${{e11}}#$b#Can't you pretend I made it?${{e1}} @@ I have a little ritual planned in here for later today.#$e#Don't worry, it won't make a mess.${{e1}}#$b#Probably...${{e11}} |inputSeparator=@@}}",
            "Indoor_Day_2": "{{Random: Come, @, let us meditate.${{e1}}#$e#You shall never improve if you never practice.${{e9}} @@ @, core of my heart.${{e6}}#$b#Did you sleep well?${{e1}}#$e#I did, with you beside me.${{e6}} @@ You keep the refrigerator very well-stocked with products of the farm.#$b#It makes it difficult for me to be useful by offering to do the shopping.${{e1}} |inputSeparator=@@}}",
            "Indoor_Day_3": "{{Random: I attempted to make breakfast for you, this morning.${{e11}}#$e#Attempted, being the operative word.${{e10}}#$e#I am afraid you will have to make do on your own.${{e10}} @@ Nngh... I had this bizarre dream about a %adj %noun.${{e3}}#$b#I wonder what it means. An omen, perhaps...${{e3}}#$e#I'm sure I have a book on this, somewhere...${{e3}} @@ Hmm...I think I might take a walk in the forest soon. I'm getting a little antsy in here.${{e3}}|inputSeparator=@@}}",
            "Indoor_Day_4": "{{Random: I thought about trying my hand in the kitchen, again. I got as far as staring at that contraption with the large knobs. What did you call it? A stove?${{e3}}#$e#Perhaps I should stick with my potions... a cauldron is a simple thing.${{e9}} @@ Having watched you go about your business on the farm more than once, now, I will no longer find your physique a mystery.${{e7}}#$b#I didn't say I would stop admiring it.${{e6}}#$e#Ahem. What? Nothing.${{e4}}#$b#Go on. Don't you have... heavy objects to lift?${{e4}}#$b#I'll just be over here.${{e7}}#$b#Unquestionably paying close attention to something else.${{e9}} @@ Do you think we have room in here for another bookshelf?${{e1}}|inputSeparator=@@}}",
            "Indoor_Night_0": "{{Random: I had excess supplies for my ritual, today. [60 62 64 66 68 70 72 74 386]#$e#Perhaps you can put it to use.${{e3}} @@ Welcome home, my heart. It has been a terribly long day in your absence.${{e6}}#$e#No, nothing in particular happened. I merely missed you.${{e1}} @@ It promises to be a chilly night tonight.#$b#A good excuse to snuggle up.${{e6}}|inputSeparator=@@}}",
            "Indoor_Night_1": "{{Random: Ah, @. It warms my soul to have you once more beside me.${{e1}}#$b# Come. Speak to me of your day; I wish to hear everything.${{e7}}#$e#Me? I encountered a curious sprite lost between planes. I was able to guide it back on course, with no harm done.${{e1}} @@ Did you have a productive day, today? You look full ready for bed.${{e1}}#$b#Why not take a break, tomorrow? You work hard enough.${{e1}}#$e#What do you mean I'm the one always overworking?${{e3}} @@ I'm sure you had a productive day today. Make sure you take the time to relax this evening.${{e1}}#$e#%Magnus smiles at me. |inputSeparator=@@}}",
            "Indoor_Night_2": "{{Random: No, I did not attempt to make dinner. No, there is nothing in the sink.${{e10}}#$b#Burnt smell? What burnt smell?${{e11}}#$e#I have no idea what you speak of.${{e11}} @@ Ah, @. Home at last.${{e1}}#$b#How did I survive so long without you?${{e6}}#$e#Yet another mystery.${{e7}} @@ A long day for me. I'm happy to see the end of it...#$e#How was your day?${{e1}} |inputSeparator=@@}}",
            "Indoor_Night_3": "{{Random: I encountered young Leah, today, in the forest. When she beheld me, she said 'what is up, canis lupus familiaris?' and began laughing uncontrollably.${{e11}}#$e#Is this some conversational ritual I am unfamiliar with?${{e10}} @@ Are you through with your work for the day?${{e1}}#$b#Might I convince you to... join me in bed?${{e6}} @@ I've got some traveling to do for the Guild soon. Even thinking about it is making me exhausted...${{e10}}|inputSeparator=@@}}",
            "Indoor_Night_4": "{{Random: @. Core of my heart. Welcome home, my love.${{e1}}#$b#It is difficult for me to understand how I lived so long without you, when each day I spend every minute awaiting your return.${{e9}}#$e#Except the minutes when I commune with the energies. Sometimes I lose those minutes. But every other minute, my mind is yours.${{e6}} @@ Come to bed, my heart. My arms have been too long without you.${{e6}} @@ Remind me to show you the charm I've been working on recently. It's a spell of protection, but the effects are quite eye-catching.${{e1}} |inputSeparator=@@}}",
            "Outdoor_0": "{{Random: Have you ever experienced crop circles on your farm?#$e#Some say they are the work of aliens. Fools. Did they never think to look at what was right under their noses?${{e3}}#$b#Of course it is the elementals.${{e1}} @@ The air is crisp and clear. I can feel the energies rising to meet me.${{e9}}#$b#I shall spend some time here, communing with the elementals.${{e1}}#$e#You don't mind if I use the porch, do you?${{e3}} @@ *hums* Hello there, @! Wonderful day, isn't it?${{e1}} |inputSeparator=@@}}",
            "Outdoor_1": "{{Random: Ah, @, you're just in time.${{e1}}#$b#I am about to begin my meditation to reach across plains. You should join me${{e1}}#$e#Practice makes perfect.${{e9}} @@ I considered developing an enchantment to assist in your work...${{e3}}#$b#Unfortunately, my first attempt ended in tragedy.${{e2}}#$e#You don't want to know what happened.${{e11}}#$e#The animals are all completely fine.${{e10}} @@ Have you been to Castle Village? I much prefer the air here. It's cleaner, crisper, and doesn't reek of magic.|inputSeparator=@@}}",
            "Outdoor_2": "{{Random: I require some space to perform a ritual. You don't mind if I use just a little bit, do you?#$e#I won't destroy much of anything.${{e3}}#$b#...unless things go wrong.${{e11}} @@ Jyokilius pijus, ribe, agyce...#$b#Ah, @!${{e3}}#$b#You really should know better than to break my concentration mid spell.#$e#I might have set fire to the barn.${{e3}}#$e#Again.${{e10}} @@ Growing things always bring a surplus of mana to the world around them. It's so concentrated on this farm that it's almost overwhelming.#$e#It feels so tremendously alive.${{e1}}|inputSeparator=@@}}",
            "Outdoor_3": "{{Random: The summoning circle is complete!${{e1}}#$b#Now I only need to collect a few more supplies...${{e3}}#$e#Ah... incidentally... you didn't need those... crops in the far field, did you...?${{e10}} @@ Your farm truly is extraordinary, @${{e3}}.#$b#Have you any idea how much attention you have attracted from across the veil?${{e1}}#$e#I need only stand here in the midst of it all to speak with them...${{e1}} @@ I'm running low on some of my potion supplies. I'll need to head into the forest to collect more soon.${{e3}}|inputSeparator=@@}}",
            "Outdoor_4": "{{Random: Some days I find myself sluggish and lethargic, in spite of a full night's sleep.${{e3}}#$b#The energies are a fickle thing.#$e#But seeing you hard at work energizes me.${{e1}} @@ Have an enchanted day, my heart.${{e1}}#$e#I would offer to have dinner ready on your return, but we both know that would end poorly.${{e7}} @@ I spotted a rare bird over the farm this morning. I wonder if it flew in from the Fern Islands.${{e3}}|inputSeparator=@@}}",
            "OneKid_0": "{{Random: Despite the focus I have on my studies, I had always wanted to be a father. At long last, I can see this wish come true.${{e1}}#$e#Just one more thing you have granted me.${{e7}} @@ Have you seen %kid1, recently?${{e3}}#$e#What? No. Of course I didn't lose our child${{e11}}#$b#Everything is under control.${{e9}} @@ There's something magical about children, isn't there?${{e1}}#$b#Imagination without limits is a powerful tool.${{e9}} @@ When our child is old enough, we should go for a vacation on Ginger Island.${{e3}}#$e#I'd like them to grow up with a wide view of the world, beyond just this little valley.${{e1}}|inputSeparator=@@}}",
            "OneKid_1": "{{Random: I have come to realize how little I understand about children. If I thought communication with humans was difficult, it is nothing compared to communication with a child. Why does %kid1 not heed me?${{e10}}#$b# I have tried every language I have at my disposal!${{e11}}#$e#What do you mean babies do not speak?${{e10}} @@ Sometimes I can hardly believe that we have a child.${{e1}}#$e#Then I remember you trust me enough to leave me alone with said child and everything else seems much less mysterious in comparison.${{e7}} @@ Ah... All of the magical training in the world couldn't have prepared me for the challenge a dirty diaper presents.${{e7}} |inputSeparator=@@}}",
            "OneKid_2": "{{Random: %kid1 is not so different from an elemental: born of the energies of the universe, unforgiving, and utterly incomprehensible.${{e1}}#$e#Do you think %kid1 would like swamp moss, as well? I believe I have some here, somewhere...${{e3}} @@ I will feed %kid1, this morning, so you can focus on your work.${{e1}}#$e#Yes, I know. Raw eggplant is not breakfast.${{e7}}#$b#I remember.${{e7}} @@ I hope that our child contains the best parts of both of us. And hopefully not too many of the worst.${{e9}} |inputSeparator=@@}}",
            "OneKid_3": "{{Random: You aren't leaving us here alone, are you?${{e3}}#$b#Is that... entirely wise?${{e3}}#$b#Very well, but I sense there is at least a fifty percent chance that either %kid1 or I will not survive your absence.${{e11}}#$e#Wait! Before you leave!#$b#How does a pacifier function?${{e3}}#$b#Is there milk in the fridge? What temperature should I heat it to?${{e3}}#$b#How long should %kid1 nap?${{e3}}#$b#What if %kid1 cries?${{e11}}#$b#Will you be back for lunch? Dinner?${{e3}}#$b#How do I change a diaper?${{e3}}#$b#What is the purpose of a baby blanket?!${{e3}}#$e#Please return soon.${{e10}} @@ Our whole lives have changed with %kid1, here.${{e1}}#$e#I don't regret a thing.${{e7}} @@ Have you seen any hints of magical activity in our child? Well...the signs don't always show up this early.${{e3}} |inputSeparator=@@}}",
            "TwoKids_0": "{{Random: When I said I wished to be a father, I do not think I fully understood the implications.${{e3}}#$b#What I meant was that I should like to have the knowledge that I had brought a life into this world, and to watch a child grow to maturity and strength before they moved on to do good unto the world.${{e3}}#$e#I did not realize that involved quite so much work.${{e1}} @@ Do you ever stand here and marvel at the two beautiful children our love has brought into the world?${{e9}}#$e#I do every day.${{e1}} @@ Of all the beautiful places I've visited in the course of my work, none of them hold a candle to this farmhouse with our little family.${{e1}}#$e#%Magnus smiles at me. @@ I do hope at least one of our children decides to follow in my footsteps.#$e#I suppose that's a little vain, isn't it? But the world of magic is one I'd like all of us to share.${{e1}} |inputSeparator=@@}}",
            "TwoKids_1": "{{Random: Do you find it unsettling that %kid1 and %kid2 have a half-sibling among the villagers?${{e3}} @@ %kid1 got into my surpluss potion ingredients, the other day.#$b#I believe that is a sign: it is high time for formal training to begin.${{e3}}#$e#%kid2 is still too young, but %kid1 is old enough to grasp the basics of energy flow and bridging...${{e1}} @@ Children aren't like cats, are they? Two really are twice as much work.${{e3}}#$b# ...At least.${{e10}} |inputSeparator=@@}}",
            "TwoKids_2": "{{Random: I went to work in my tower, the other day, expecting increased productivity in the quiet...#$b#and yet, as soon as %kid1 and %kid2 were out of my sight, I felt an ache of longing to hold them in my arms once more. I could not even focus for long enough to complete a single ritual.${{e2}}#$e#Is this what it means to be a father?${{e3}} @@ We're blessed that %kid1 and %kid2 have your features${{e7}}.#$e#It would be a cruel twist of fate indeed for any child to look like me.${{e9}} @@ I think I saw one of our children manifesting early signs of telekinesis today!${{e3}}#$e#A teddy bear slid right off a shelf...perhaps they summoned it!${{e3}}#$b#...Yes, I admit that the bear may have simply fallen down.${{e10}} |inputSeparator=@@}}",
            "Twokids_3": "{{Random: %kid1 has your eyes. Sometimes we lock gazes and I find myself lost in them. I wonder what a child sees when looking upon one such as I.${{e3}}#$e#A father, I hope. And nothing less.${{e1}} @@ This life... with you and our children...${{e4}}#$b#It's more than I ever thought I would have.${{e1}}#$e#Thank you, @, for choosing me.${{e6}} @@ What do you think of asking Abigail to babysit?#$e#...Just a thought.${{e9}} |inputSeparator=@@}}",
            "Good_0": "{{Random: Once I was a young man, foolish and restless and hungry for knowledge.#$b#I used to lament the loss of those days - it is an oft-stated tragedy that youth is wasted on the young - but I have come to realize that such days of vibrant energy are not lost to me.${{e1}}#$b#You have brought them back, @.${{e7}}#$e#You give me life anew, as I never expected to have.${{e1}}#$b#For this I can never repay you, but ever will I try.${{e1}} @@ I still cannot believe that you chose to marry me...${{e6}} @@ Ah, greetings, my heart! I was just thinking about you.${{e1}} |inputSeparator=@@}}",
            "Good_1": "{{Random: The dark dreams of my past are a fading memory. When I sleep at your side, not only do I sleep - an uncommon enough occurrence, once - but I sleep soundly.${{e1}}#$b#That is your doing. The calm of your soul soothes mine.${{e9}}#$e#When you are with me, I am invigorated.${{e1}} @@ Not even in all of my forays into the future did I predict I could ever be so happy as you have made me.${{e6}} |inputSeparator=@@}}",
            "Good_3": "{{Random: @.${{e6}}#$b#My @.${{e6}}#$b#How effortlessly you make me forget my flaws and past failures!${{e7}}#$b#When I see myself through your eyes, it is as if I have been reborn. That you could know all you know of me and still love me so is beyond even my comprehension.${{e1}}#$b#I am undeserving of such devotion, but nevertheless I thank you for it.${{e1}}#$e#Never will I fail you. I swear it.${{e6}} @@ My love, you look simply radiant.${{e6}} @@ I hope you're having a wonderful day, my love.${{e1}}|inputSeparator=@@}}",
            "Good_4": "{{Random: Have I expressed, lately, how I feel for you? If not, I have been remiss.${{e1}}#$b#My love for you overwhelms every other truth of my soul. Without you, I was a husk of a man, adrift in a world without meaning and lamenting my place in it.${{e6}}#$b#With you, I am as a slate wiped clean.#$e#I have no regrets, anymore.${{e6}} @@ This... this is more home than ever my tower was. Or any place I dwelled before that.${{e1}}#$e#From now on, my home is with you. My heart.${{e6}} @@ My tower is stocked with all kinds of rare books and reagents, and charms that I've collected from around the world that are nearly impossible to find.#$b#But none of it holds a candle to how precious you are to me.${{e6}}#$e#I realize that was a terrifically corny thing to say. But thankfully, you don't seem to mind.${{e9}} |inputSeparator=@@}}",
            "Good_5": "{{Random: Any trace of that loneliness which once plagued me is banished by your presence. I had no idea how much I craved a contact outside the ethereal before our paths crossed.${{e6}}#$b#And now our souls are entwined as two trees grown together.${{e6}}#$e#It would take an axe to separate us.${{e6}} @@ @... this wedding amulet it's flawless.${{e4}}#$b#You know I don't care for trinkets without practical use, but this...${{e4}}#$b#This is a symbol of us.${{e6}}#$e#It is more important than anything else I have ever owned.${{e6}} @@ We should go on a little retreat together soon. I can pull some strings with the Guild to find us a place in a cozy little town in the mountains somewhere.${{e1}} |inputSeparator=@@}}",
            "Good_6": "{{Random: If you venture into the mines, beware, my heart.#$b#I have told you before of the evil that lurks there.${{e2}}#$b#I don't know what I would do if you fell prey...${{e8}} @@ I love you for many reasons, but one is how talented you are. You're adept at anything you put your hand to.#$e#I admire you greatly for that.${{e4}} |inputSeparator=@@}}",
            "Good_7": "{{Random: @. This house is a home because of all the work you do.${{e1}}#$b#Never let yourself believe I don't notice.${{e1}} @@ Do you know, I don't think I've ever been so happy in all my life as I am with you, @.${{e1}} |inputSeparator=@@}}",
            "Good_8": "Sometimes, seeing all you do for us, I wonder how I survived before you married me.${{e3}}#$e#Then I remember I once subsisted an entire week on swamp moss and algae broth because my food delivery was delayed in a winter storm...${{e7}}",
            "Good_9": "This peace...${{e9}}#$b#This is what I always craved and never thought I would feel again.${{e4}}#$e#Thank you, @.${{e6}}",
            "Neutral_0": "{{Random: I hope you won't regret your decision to marry me when my hair turns grey and you are still quite young...${{e2}} @@ Joy is a mysterious power. Fragile in its most pure state, when it does appear it can resonate through the ages.${{e3}}#$b#Yet, that same joy can become corrupted over time. It must be protected, at all cost. @@ Don't work too hard today. I don't want to have to levitate your limp body home.${{e2}}#$e#...If you unfortunately do pass out somewhere before I can find you... I trust Linus will take care of you. |inputSeparator=@@}}",
            "Neutral_1": "{{Random: There are potent energies about your grandfather's shrine.${{e3}}#$b#Do you think he would be proud of how far you have come?${{e1}}#$e#I believe he is.${{e1}} @@ Anger and hatred, they are false energies. They hide the real sources of power, which is understanding and sadness.#$b#It has become cliche, but it's true. I have learned so much, and it still holds true. Find peace before you tear yourself to pieces. @@ Having a pleasant day, @?$ |inputSeparator=@@}}",
            "Neutral_2": "{{Random: Ah, @. Come for another lesson on the energies? I'm happy to oblige.${{e9}}#$e#It means more time with you.${{e1}} @@ Using the energies comes at a cost. It's not free. To discuss all the different aspects would take ages.${{e3}}#$b#I'll tell you this though, @. My hair was not originally purple.${{e1}}#$e#That was a long time ago...${{e7}} |inputSeparator=@@}}",
            "Neutral_3": "{{Random: I once thought I would live out the rest of my days locked away in that tower without even a single friend...${{e2}}#$e#You set that ambition on its nose${{e1}}#$b#Not that I'm complaining.${{e7}} @@ I once saw a person try to keep a tree alive all year long, using powerful energies to do so.#$b#It was horrible: the tree itself wept, and begged to be freed. I had to step in and save the tree.${{e2}}#$b#I still have some of its leaves it gave to me as a gift. They are special to me.${{e2}} @@ The farm seems to be doing very well this year.${{e1}} |inputSeparator=@@}}",
            "Neutral_4": "{{Random: Hmm...? Yes, I'll pick up the pile of books as soon as I'm finished...${{e9}} @@ If you go into town, make sure and say 'what's popping?' to everyone for me.${{e7}} |inputSeparator=@@}}",
            "Neutral_5": "{{Random: How are we doing, financially, @?${{e3}}#$e#If there is anything I can do, you need only ask. @@ I don't know how you worked in Zuzu City. The smells and the noise there would give me a headache.#$e#I prefer places that are more tranquil, like Stardew Valley.${{e1}} |inputSeparator=@@}}",
            "Neutral_6": "{{Random: Another day, another mystery to solve...${{e7}} @@ I never saw the appeal in fishing. I'm glad you enjoy it, though. |inputSeparator=@@}}",
            "Neutral_7": "{{Random: Have you been practicing meditation, like I taught you?${{e9}} @@ I need to make a trip to Castle Village soon to see Camilla to discuss some Ministry affairs. She's certainly an interesting woman.#$e#She approves of you, you know.${{e1}} |inputSeparator=@@}}",
            "Neutral_8": "{{Random: Hmm?${{e3}}#$b#Mess? No. I haven't noticed any.${{e11}} @@ Let's go for a little walk soon. A change of scenery will surely do us good.${{e1}} |inputSeparator=@@}}",
            "Neutral_9": "If you find yourself obsessed with something you've never been interested before, it can mean you have been enchanted.${{e3}}#$b#Not all enchantments are bad, of course. Some can be quite positive. It is very mysterious.${{e1}}#$e#Embrace the mysteries of the day, @.${{e9}}",
            "Bad_0": "{{Random: You know I have been married once before and it went badly. I would not like for this to go the same direction.${{e2}}#$e#I do not think my heart would survive the breaking for a second time.${{e8}} @@ ...Do you still love me?${{e2}} @@ *sigh* I've made some serious mistakes in the past, @. Eventually, I'll need to address them.${{e2}}#$e#Hopefully, you'll be by my side when those times come. |inputSeparator=@@}}",
            "Bad_1": "{{Random: Black omens darken the horizons of our future.#$b#Will you heed the signs and change course, or will you continue as you have been?#$e#Do not make a choice you will later regret, @.${{e10}} @@ ...I should never have married again.${{e11}} @@ I may go spend some time in my tower... You've done nothing wrong. I just need some time to myself. |inputSeparator=@@}}",
            "Bad_2": "{{Random: This is... hmm. Interesting. If I can just focus my energies, I might be able to...${{e2}}#$e#...#$e#Hm? Begone; I am busy. You would not understand something so delicate. @@ You regret it, don't you?${{e2}}#$b#Your choice to marry me.${{e8}} @@ That blasted woman...Camilla is brimming with talent, but sometimes she can be positively infuriating.${{e5}} |inputSeparator=@@}}",
            "Bad_3": "{{Random: And so begins the fall beyond the summit... The descent will not be as joyous as the climb was, I fear.${{e10}}#$b#I wonder if we will catch our bearings before the landslide crumbles out of control...${{e2}}#$e#It pains me to look back and see how far we have fallen, already.${{e8}} @@ Have I done something wrong...? It seems everything is falling apart, lately...${{e8}} @@ ...Are you really happy with me?${{e2}}#$e#Sorry, I know it's not a fair question to ask. Never mind.${{e2}} |inputSeparator=@@}}",
            "Bad_4": "{{Random: Hmph. @@ I had hoped I would only ever live through one broken heart...${{e8}} @@ A new spell I was testing backfired. I feel... not quite myself.${{e10}}#$e#If you wake up to a frog in the bed tonight, I left a little satchel of powder on the table.${{e10}}#$e#Just sprinkle some on me.${{e10}}#$e#...${{e11}}#$e#%Magnus doesn't look so good... |inputSeparator=@@}}",
            "Bad_5": "{{Random: I should never have let you marry me.${{e10}}#$b#I seem only to make your life worse.${{e8}} @@ I'm feeling quite out of sorts today. No, I don't think there's anything you can do to help. |inputSeparator=@@}}",
            "Bad_6": "{{Random: We only have one short life to live... is this the best way to do it?${{e10}} @@ I don't work as effectively on the farm as I do in my tower. Too many distractions.#$e#Ah, I... I apologize. I didn't mean for that to come off that way.${{e2}} |inputSeparator=@@}}",
            "Bad_7": "{{Random: If there is anything I can do to fix this, please, tell me!${{e2}}#$b#I'm not ready to fail again as I have done in the past.${{e8}} @@ My ex-wife flew over my tower last night and managed to burn some of the nearby trees to a crisp.${{e5}}#$e#That foolish woman could start a forest fire if she's not careful.${{e5}} |inputSeparator=@@}}",
            "Bad_8": "{{Random: You have been so cold to me lately... @@ I'm not in the mood to talk today. It'll pass soon. |inputSeparator=@@}}",
            "Bad_9": "If only I had been better for you...${{e8}}",
            "spring_1": "{{Random: The energies have begun again. Spring is here, and the year is reborn.${{e9}}#$e#I feel renewed this year, not just because spring is the time for it, but because of my relationship with you, @.${{e6}}#$b#You have reminded me that I am still human. To focus on being human is a mystery itself that I almost forgot about.${{e9}}#$e#Thank you, @.${{e1}} @@ You always know spring has arrived when you can hear the trees singing of new growth.${{e1}}#$e#Mmm? Yes, of course the trees sing. You can hear them too, just listen carefully.${{e1}} |inputSeparator=@@}}",
            "spring_2": "I am always glad to wake beside you, @. I had predicted we would become friends, but I had no idea how far it would go.${{e1}}#$b#There are many mysteries in this world, and I am glad you chose me as one of yours.${{e6}}#$e#I count myself to be very lucky indeed.${{e7}}",
            "spring_3": "Many people are scared of me. The unknown causes them to tremble, and my association with it frightens them.#$b#You have continued to show you don't mind the mysterious. You embrace it, and take time out of your day to see me.${{e1}}#$b#Thank you, @. I thought I would be alone forever.${{e7}}#$e#You are a special person, indeed.${{e6}}",
            "spring_5": "I feel renewed this year, not just because spring is the time for it, but because of my relationship with you, @.${{e6}}#$b#You have reminded me that I am still human. To focus on being human is a mystery itself that I almost forgot about.${{e1}}#$e#Thank you, @.${{e1}}",
            "spring_6": "The air is electric, I feel this year will be a special one. Let us do our best to achieve our dreams, @.${{e1}}#$e#Do not give up. I will be with you.${{e1}}",
            "spring_8": "The greatest energies are the ones we allow ourselves to find. Everything else is false.${{e1}}#$b#Be true to what moves you, and you will be energized the rest of your life.${{e1}}#$e#That is my hope for you, @. Live forever!${{e7}}",
            "spring_13": "{{Random: What, exactly, is the purpose of hidden eggs?${{e3}}#$b#Is there some symbolism I don't comprehend?${{e3}}#$b#The eggs, perhaps, represent that which you need but do not desire, and so you seek because you must.${{e3}}#$e#No...?${{e3}}#$e#Of course I'm not going.#$b#I have quite enough mystery in my life without incomprehensible traditions.${{e1}} @@ The day of the egg festival again, is it? Every year, I wonder what kind of ritual began the egg hunting tradition...${{e3}}#$e#I'm sure it was something quite ancient.${{e3}} |inputSeparator=@@}}",
            "spring_23": "The energies, at their core, are chaotic. Ever changing, they are denser than air yet more elusive than wind.${{e3}}#$b#In the end, many people believed it was not worth trying to solve the mystery, yet here I remain.#$e#Someday, @, I will truly understand.${{e1}}",
            "summer_1": "{{Random: Summer has come at last. The energies are at their most powerful. I'll get a lot of work done this season.${{e1}}#$b#Stay cool, @, and do not let the sun curse you.${{e9}}#$e#Maybe we'll go swimming this time...${{e4}} @@ Summer has arrived! With all the plants lush and growing, you'll find it's much easier to draw mana from the world around you.${{e1}} |inputSeparator=@@}}",
            "summer_2": "I still marvel that you would ever choose to be with one such as me. I am much too old and jaded for someone so full of life. And yet, here we are.${{e7}}#$e#You are the mystery I will never solve. Have an enchanted day, @.${{e1}}",
            "summer_3": "Ignorance is bliss. You've heard that saying before, I'm sure, but it's true. To know too much, it can turn one bitter.#$b#I still find hope in my studies, but some days, it is nearly too much to bear. Thank you for choosing me, @.${{e1}}#$e#You are what holds me to this reality.${{e1}}",
            "summer_4": "The focus on my life has always been on my studies now. Everything else fell away.#$b#Becoming close with you, though, has made me realize that maybe I should not be so consumed by the search for knowledge..${{e1}}#$b#There's more to life than reading the books about the lives of the dead.${{e9}}#$b#Now there is you.${{e6}}#$e#I am with you, @. I always will be.${{e6}}",
            "summer_5": "Using the energies comes at a cost. It's not free. To discuss all the different aspects would take ages.#3#$b#I'll tell you this though, @. My hair was not originally purple.#7#$e#That was a long time ago...${{e3}}",
            "summer_8": "There is a special energy in the air today. I can feel it, can you?${{e1}}#$b#It is the energy of our love! It is invigorating. It makes me feel young again.${{e1}}#$e#Is that weird? I don't get out much, @.${{e9}}",
            "summer_11": "{{Random: I have no interest in this governor, nor in the pomp and ceremony designed to impress him.#$b#But I will attend the festival.${{e1}}#$e#The activity on the beach draws out curious merfolk.${{e3}}#$b#It provides me a unique opportunity to converse with them.${{e1}} @@ It's the luau today, yes? I'm sure whatever the town comes up with will be as peculiar as usual.${{e3}} |inputSeparator=@@}}",
            "summer_15": "One can get so caught up in work that life just falls away. Others retreat to their work because they cannot handle their life.#$b#I'm realizing lately that I've done a lot of things that I wasn't happy with. Forced myself to do what was wrong for what I thought was right.${{e2}}#$b#I hope to someday get forgiveness, @.#$e#Someday.${{e1}}",
            "summer_28": "{{Random: The season of the Lunaloos is upon us.${{e9}}#$b#Of all the peculiar things people in this town choose to celebrate, this is the one I can understand.${{e1}}#$e#I would prefer to avoid the crowds on the docks, however.#$b#I'm sure you'll find me, regardless.${{e1}}#$b#You always do.${{e7}} @@ The lunaloos are visiting us today. We understand very little about them, but...#$b#They certainly have more mystical powers than any of the other sea creatures we've studied.${{e1}} |inputSeparator=@@}}",
            "fall_1": "{{Random: Can you feel the changes in the air? I don't just mean in the temperature. The trees, they are giving off a unique energy.#$e#May this fall be an enchanted one.${{e1}} @@ Mushrooms are abundant in the fall. They're very versatile for potionmaking!${{e1}}#$e#If you do any foraging this season, I'd be happy to take some off your hands.${{e9}} |inputSeparator=@@}}",
            "fall_2": "Studying and using the energies can make one very tired, @. All these years of it has brought me to the brink.#$b#Yet it is my curiosity that drives me. I don't have all the answers, and there are still questions I have.${{e3}}#$b#Like you, @. What continues to bring you back to me, time and again?${{e7}}#$e#Perhaps someday I will understand you.${{e1}}#$b#Then again, I enjoy the mystery.${{e9}}",
            "fall_3": "There have been times when I have had the chance to wield unlimited energy. Many would be tempted by such power.${{e3}}#$b#I am only human. I was lucky to reject them, for it would have destroyed me.#$b#All that glimmers is not always good, @.#$e#Who knows what I would have become? A scary thought.${{e2}}",
            "fall_4": "Am I a better person than I was before all this? In all my searching, have I been able to find a way to become stronger?${{e3}}#$b#I have answers to many mysteries, but they haven't changed me. They are only answers. Have I done all I can?${{e2}}#$e#I have thought about these things for a long time. My own mystery.${{e3}}",
            "fall_8": "It is difficult to remember what it is to have normal conversations. When conversing with the energies, one must speak a unique and complex language.#$b#To talk human is to ask how another is, and to do that with meaning is hard for me. Luckily, I can practice on you.${{e1}}#$e#What's up, dog? No? Is that not a saying?${{e3}}",
            "fall_15": "Words can't express how grateful I am for you, @. It is nice to be able to talk with someone about all the aspects of my work.${{e1}}#$e#...Amongst other things.${{e4}}",
            "fall_16": "{{Random: My old friend Welwick has come to town for the fair.${{e1}}#$b#Her divination skills outshine even mine.${{e9}} @@ I hope your preparations for the showcase have gone well? You have considerable talent to showcase, my heart.${{e9}}#$e#%Magnus smiles at me. |inputSeparator=@@}}",
            "fall_25": "I have been focusing my energies lately to find the answer to this question: how is it that when I'm out and about I'm tired, but when I try to sleep, I cannot?${{e3}}#$b#It is a grand mystery, @. Someday I will solve it.${{e2}}#$e#Until then, I count on your soothing presence to lull me to sleep each night.${{e6}}",
            "fall_26": "I will be making another maze for the festival, tonight.${{e1}}#$e#It's the only time of year I can contrive such a simple way for the elementals to observe the affairs of mundane folk so closely.${{e9}}",
            "fall_27": "I have important business with the town maze today! Lots of mana required, and the work takes a great deal out of me.#$e#I hope you and the rest of the townsfolk enjoy it. ...And I apologize if I have to lean on you on the walk home.${{e1}}",
            "fall_28": "I sense a strong winter storm brewing...",
            "winter_1": "{{Random: It is a time for peace and study. The snow fall has made me weak, and I will rest.#$e#I hope this will be a special winter for us, @.${{e1}} @@ Quite a storm, wasn't it? But the world looks lovely blanketed in snow, even if the weather is harsh.${{e1}} |inputSeparator=@@}}",
            "winter_2": "I wish I could reveal my true name to you, @. In truth, I just don't remember it.${{e1}}#$b#Was it Carl? Or Hank? Maybe John?${{e3}}#$b#I think it was a good name. It's hard to know.${{e3}}#$e#Maybe it was @! Imagine that?${{e1}}",
            "winter_4": "My name is...I still don't remember.${{e3}}#$b#Yes, Magnus Rasmodius is not, in fact, my real name.${{e3}}#$b#I made it as an alias upon beginning my magic practice, but with time, eventually I and everyone around me forgot my original name.#$b#What is it, do you not like Rasmodius? We're you planning on taking it?${{e1}}",
            "winter_6": "All in all, remember this, @: the only energy you truly need is your own.${{e1}}#$b#Use that logic, and seize the day. Let nothing stop you!${{e7}}#$e#Unless it's not a good idea, in which case, don't do it.${{e10}}",
            "winter_7": "There is a great feeling in our relationship. I hope someday to be able to be as natural as I am with you with the whole village.${{e7}}#$b#They still fear but, someday, hopefully, they'll give me a chance. You have.${{e1}}#$e#That's made all the difference.${{e9}}",
            "winter_8": "{{Random: Hmm...? The festival?#$b#I have no interest in fish or ice sculptures.#$b#And you know full well I'm no good at socialization.${{e11}}#$e#I think I will visit my tower, instead.${{e1}}#$b#In spite of the weak ambient energy this time of year, I believe I can muster the strength to occupy myself.${{e9}} @@ I presume you'll be ice fishing at the festival today? Best of luck, @.${{e1}}#$e#There's a spot in the forest with arcane potential I'll be assessing. You're welcome to join me when you're finished putting Willy in his place.${{e7}} |inputSeparator=@@}}",
            "winter_12": "The Night Market is coming up in just a few days. I typically don't bother with such shallow affairs, but I've picked up some rare ingredients in the past there that have come in quite handy.${{e3}}",
            "winter_15": "Night Market?#$b#Bah! I have little time for such frivolous affairs.${{e3}}#$b#Not even the merfolk would bother with that light parade.${{e3}}#$e#By all means, enjoy yourself.${{e1}}#$b#It's just not for me.${{e9}}",
            "winter_17": "Happy... Birthday...?${{e3}}#$b#...Don't tell me I've forgotten your birthday.${{e10}}#$b#It's... mine? Ah, I guess it is.${{e3}}#$b#We don't have to do anything, my love. Spending time with you already makes me happier than you could ever imagine.${{e1}}#$e#If you really insist on celebrating, perhaps we could go to the Night Market tonight?${{e1}}#$b#I know I called it frivolous earlier, but it's a good excuse to get out of the house, no?${{e9}}",
            "winter_25": "All those people gather together to feast over the supposed good fortune of the Winter Star, and it isn't even a star.${{e3}}#$b#Not that anyone - excepting you, of course - would listen if I tried to tell them that, in the deep of winter, even an untrained eye can see the glimmer of of the astral plane.${{e1}}#$e#I do support a celebration of the waxing energies. But I don't support this ignorance.${{e3}}#$b#I will, of course, attend if you wish me to. But only for you, my love.${{e9}}",
            "winter_28": "What a year it has been. I'm glad we have grown so close, @. It would have been very boring without you.${{e6}}#$b#Just me and the Shrine of Illusion, making faces at each other.${{e1}}#$e#I still make faces at the Shrine. I'm not sure it appreciates it.${{e7}}",
            "spouseRoom_Wizard": "{{Random: Strange Basilisks... Fundamentals Of Goblins... Unicorns of Timor-Leste...${{e3}}#$e#No, no, that's not it...#$e#Where did I leave that book...?${{e3}} @@ Mmm...I don't wish to take the farmhouse over completely, but I do wish I had a few more of my spellbooks here to consult.${{e3}} @@ I wonder if it is possible to magically expand the farmhouse... I wouldn't mind a spare basement for some extra arcane doodads.${{e3}}#$b#Do you have any opinions on the matter, @?${{e3}} |inputSeparator=@@}}",
            },
        },
        //FunLeaveReturn Variety
        { //Spring
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "spring"},
        "Entries": {
            "funLeave_Wizard": "{{Random: I require some things from my tower; if you seek me there, today, you will find me.#$e#Embrace the mysteries of the day, @.${{e7}} @@ Off on some arcane errands. I'll return in time for dinner, I promise.${{e1}} @@ I must tend to the plants in my tower today.#$b#Some of them are rare flower variants, does the farmer have any tips?${{e1}}#$b#I hope your day goes smoothly, love, I will see you tonight.${{e7}} |inputSeparator=@@}}",
            "funReturn_Wizard": "{{Random: To return to this home we share is a relief. Never before had I thought of my tower as empty, and yet it feels that way without you there.${{e1}}#$e#I passed a productive day, nevertheless.#$b#Come, let us be together and share in each other's memories.${{e7}} @@ What a wonderful place this is to return to.${{e1}}#$b#...Straight into your arms.${{e6}} @@ A contact from Castle Village reached out to me today offering some rare literature in exchange for hard to come by supplies.${{e3}}#$b#As it turned out, the book was an ancient spellcasting glossary that specifically focuses on agriculture.${{e1}}#$b#It could well prove to be very interesting, I hope it will contain something of use to your farm.${{e9}} |inputSeparator=@@}}",
            },
        },
        { //Summer
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "summer"},
        "Entries": {
            "funLeave_Wizard": "{{Random: Today, I should go check on my tower's garden.${{e9}}#$b#Ancient fruit need more water than most other plants. It's possibly the reason they almost went extinct...${{e3}}#$e#Might I convince you to... join me for lunch later?${{e3}}#$b#Your unexpected visits are always the highlight of my day.${{e6}} @@ The Ministry is more active this time of year, so I need to visit my tower to deal with them today.#$b#One of the perks of living here with you is that it makes me significantly harder to reach.${{e1}} |inputSeparator=@@}}",
            "funReturn_Wizard": "{{Random: Mmm, my heart... I am drained to the bone.${{e11}}#$b#The Ministry was exceedingly relentless today, springing on meetings one after another. Most of which were hardly even necessary.${{e10}}#$b#What do you say to calling in to bed early tonight? If there is any farm work left for the day let me help.#$b#I would not object to some quality bed time tonight...${{e6}} @@ Good evening, my love.${{e1}}#$b#How has your day gone? I hope the sun treated you well today.#$b#If not I can offer my lathering services tomorrow morning. ${{e6}}|inputSeparator=@@}}",
            },
        },
        { //Fall
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "fall"},
        "Entries": {
            "funLeave_Wizard": "{{Random: Take care today, love. I need the space of my tower for a ritual, it is too volatile to attempt on your farm.#$b#Of course it is safe, don't worry, I just don't wish to risk harm to your crops.${{e1}} @@ This is a busy time of year for you I know, but do mind to not overwork yourself, my heart.#$b#I need to attend to my tower today, but I will be home in the evening to help you unwind.${{e1}} |inputSeparator=@@}}",
            "funReturn_Wizard": "{{Random: The moon looked gorgeous on my way home.${{e3}}#$b#What do you say to some star gazing one of these nights?${{e1}} @@ My heart, you look positively radiant. How has your day fared?${{e1}}#$b#I believe I have been struck with a 'cuddle bug' as some would say... I have missed you terribly.${{e6}} |inputSeparator=@@}}",
            },
        },
        { //Winter
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "winter"},
        "Entries": {
            "funLeave_Wizard": "{{Random:  Good morning, my heart.${{e1}}#$b#I must leave for my tower today. If you find yourself having a slow day, I wouldn't mind your company.${{e1}} @@ I need to gather some reading from my tower today, I will see you tonight.${{e1}}#$b#Stay warm, take one of my spare capes if you need to. They are well insulated against this type of weather. ${{e9}} |inputSeparator=@@}}",
            "funReturn_Wizard": "{{Random: You look cold, my heart... I'll set another blanket on the bed tonight.#$b#I don't look much warmer myself? My, @, my cheeks can be rosy from a multitude of reasons.${{e6}} @@ I might do some extra reading in bed before we sleep if that is alright.#$b#I've quite the pile of books to get through before spring. I promise to not make much noise.${{e1}} |inputSeparator=@@}}",
            },
        },
        //Patio Variety
        { //Spring
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "spring"},
        "Entries": {
            "patio_Wizard": "{{Random: ...Hmm? It's a ritual circle.${{e3}}#$e#You remember. From our lessons.${{e1}} @@ A pleasant day to be out and about. Care to join me?${{e1}} @@ If you have time in your schedule, would you like to forage with me today? I've been lacking some crucial ferns as of late.${{e1}}|inputSeparator=@@}}",
            },
        },
        { //Summer
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "summer"},
        "Entries": {
            "patio_Wizard": "{{Random: Summer is the easiest and strongest season for meditation, the energies are as if a thin wall away.#$b#Today in particular could be a good day to practice if you'd like to, my heart.${{e1}} @@ Worry not, I remembered to apply sunscreen this time.${{e9}} |inputSeparator=@@}}",
            },
        },
        { //Fall
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "fall"},
        "Entries": {
            "patio_Wizard": "{{Random: Perhaps I should place a barrier around my work area... a single stray leaf could jeapordize today's ritual.${{e3}} @@ I think the farm looks most beautiful in the fall.${{e1}}Fall rouses my nostalgia, and somehow the farm starts to feel even more like home.${{e7}} |inputSeparator=@@}}",
            },
        },
        { //Winter
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Season": "winter"},
        "Entries": {
            "patio_Wizard": "{{Random: Though I appreciate the flush on your cheeks, make sure to stay warm today, @.${{e9}} @@ I arose feeling quite sluggish, I hoped some time outside would wake me from my stuppor.#$b#There was a tome I wanted to go through today, but right now I lack the energy to even open the first page.${{e10}}#$e#Perhaps a kiss would give me the boost I so desperately seek.${{e7}} |inputSeparator=@@}}",
            },
        },

        { //Gendered Dialogue Edits
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated","Farmer Gender": "male"},
        "Entries": {
            "fall_Wizard": "{{Random: Wind blows swiftly between the elemental planes. Can you hear them whispering, as they pass us by?${{e3}}#$b#Shh! Listen.${{e1}}#$e#You make an adept young wizard, for a farmer.${{e7}} @@ Enchantments, energies, and experiments. Though their powers are great and can do many things, they can't solve all of life's problems.#$b#They cannot, for example, make someone fall in love with another and have it be an honest relationship. It never ends well.${{e3}} @@ The time for harvest has arrived. I hope ours are bountiful this year.${{e1}} |inputSeparator=@@}}",
	        },
	    },
        {
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated","Farmer Gender": "female"},
        "Entries": {
            "fall_Wizard": "{{Random: Wind blows swiftly between the elemental planes. Can you hear them whispering, as they pass us by?${{e3}}#$b#Shh! Listen.${{e1}}#$e#You make an adept young witch, for a farmer.${{e7}} @@ Enchantments, energies, and experiments. Though their powers are great and can do many things, they can't solve all of life's problems.#$b#They cannot, for example, make someone fall in love with another and have it be an honest relationship. It never ends well.${{e3}} @@ The time for harvest has arrived. I hope ours are bountiful this year.${{e1}} |inputSeparator=@@}}",
	        },
	    },
        {
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated","Farmer Gender": "gender neutral"},
        "Entries": {
            "fall_Wizard": "{{Random: Wind blows swiftly between the elemental planes. Can you hear them whispering, as they pass us by?${{e3}}#$b#Shh! Listen.${{e1}}#$e#You make an adept young magician, for a farmer.${{e7}} @@ Enchantments, energies, and experiments. Though their powers are great and can do many things, they can't solve all of life's problems.#$b#They cannot, for example, make someone fall in love with another and have it be an honest relationship. It never ends well.${{e3}} @@ The time for harvest has arrived. I hope ours are bountiful this year.${{e1}} |inputSeparator=@@}}",
	        },
	    },
	    { //Age Dialogue Edits
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Wizard Age Appearance": "old"},
        "Entries": {
            "spring_24": "...You want me to attend the Flower Dance?${{e3}}#$b#I think not. Such frivolous displays are beyond me.#$b#Besides, I'm much too old to dance.${{e1}}#$b#You'll just have to enjoy yourself without me.${{e9}}#$e#...#$b#Please don't dance with anyone else.${{e4}}",
            "Good_2": "{{Random: Before we wed, I considered my life more or less at an end.#$b#I would toil on through the land of the living for some untold number of decades, in all likelihood, but it was as a flat ground at the bottom of a slope. Already I had climbed the mountain and come down the other side.#$b#I thought I should see no more mountains, in my time. And yet, here we are.${{e1}}#$e#You give my life new purpose, @.${{e1}} @@ You know... I fell for you long before you gave me that bouquet.${{e4}}#$e#I never said a word.${{e4}}#$b#I thought you could never love an old man like me.${{e9}} @@ With all the heartache in my past, I never thought I'd wake up to days as sweet as these...#$e#Thank you for giving an aloof old wizard a chance.${{e4}} |inputSeparator=@@}}",
	        },
	    },
        {
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Wizard Age Appearance": "young"},
        "Entries": {
            "spring_24": "...You want me to attend the Flower Dance?${{e3}}#$b#I think not. Such frivolous displays are beyond me.#$b#Besides, I'm much too untrained to dance.${{e1}}#$b#You'll just have to enjoy yourself without me.${{e9}}#$e#...#$b#Please don't dance with anyone else.${{e4}}",
            "Good_2": "{{Random: Before we wed, I considered my life more or less at an end.#$b#I would toil on through the land of the living for some untold number of decades, in all likelihood, but it was as a flat ground at the bottom of a slope. Already I had climbed the mountain and come down the other side.#$b#I thought I should see no more mountains, in my time. And yet, here we are.${{e1}}#$e#You give my life new purpose, @.${{e1}} @@ You know... I fell for you long before you gave me that bouquet.${{e4}}#$e#I never said a word.${{e4}}#$b#I thought you could never love a man like me.${{e9}} @@ With all the heartache in my past, I never thought I'd wake up to days as sweet as these...#$e#Thank you for giving an aloof old wizard a chance.${{e4}} |inputSeparator=@@}}",
	        },
	    },
        { //Ex-Wife Disabled
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueWizard",
        "When": {"Marriage Dialogue": "integrated", "Ex-Wife mentions": "disabled"},
        "Entries": {
            "Bad_0": "{{Random: ...Do you still love me?${{e2}} @@ *sigh* I've made some serious mistakes in the past, @. Eventually, I'll need to address them.${{e2}}#$e#Hopefully, you'll be by my side when those times come. |inputSeparator=@@}}",
            "Bad_1": "{{Random: Black omens darken the horizons of our future.#$b#Will you heed the signs and change course, or will you continue as you have been?#$e#Do not make a choice you will later regret, @.${{e10}} @@ ...I should never have married.${{e11}} @@ I may go spend some time in my tower... You've done nothing wrong. I just need some time to myself. |inputSeparator=@@}}",
            "Bad_4": "{{Random: Hmph. @@ I had hoped I would avoid a broken heart...${{e8}} @@ A new spell I was testing backfired. I feel... not quite myself.${{e10}}#$e#If you wake up to a frog in the bed tonight, I left a little satchel of powder on the table.${{e10}}#$e#Just sprinkle some on me.${{e10}}#$e#...${{e11}}#$e#%Magnus doesn't look so good... |inputSeparator=@@}}",
            "Bad_7": "{{Random: If there is anything I can do to fix this, please, tell me!${{e2}}#$b#I'm not ready to fail this marriage, @.${{e8}} @@ The witch flew over my tower last night and managed to burn some of the nearby trees to a crisp.${{e5}}#$e#That woman could start a forest fire if she's not careful.${{e5}} |inputSeparator=@@}}",
            },
        },
        { //Override Generic Dialogue
        "Action": "EditData",
        "Target": "Data/ExtraDialogue",
        "When": {"Override Generic Dialogue": "true", "Relationship:Wizard": "Married"},
        "Entries": {
            "NewChild_Adoption": "A family of our own... I never would have imagined.${{e6}}",
            "NewChild_FirstChild": "I have spent so long dreaming of this moment, yet nothing could hold a candle to reality.${{e6}}",
            "NewChild_SecondChild1": "You've made me the happiest man alive. Twice.${{e6}}",
        	"NewChild_SecondChild2": "Never did I foresee two beautiful children with the love of my life... This is what I was missing.${{e6}}",
            "Mines_PlayerKilled_Spouse_PlayerMale": "@! I warned you of the evils in the mine, did I not?${{e5}}#$b#...#$b#For a moment I feared I would lose you...${{e8}}",
            "Mines_PlayerKilled_Spouse_PlayerFemale": "@! I warned you of the evils in the mine, did I not?${{e5}}#$b#...#$b#For a moment I feared I would lose you...${{e8}}",
			},
        },
	]
}