{
	"Changes": [
		{
        "Action": "EditData",
        "Target": "Strings/schedules/Wizard",
        "Entries": {
		    "fall_26.000": "I'm helping prepare for tomorrow's festivities.${{e9}}",
		    "fall_26.001": "This requires the utmost concentration.${{e3}}",
		    "fall_26.002": "Please do not disturb me.${{e3}}",
		    "fall_26.003": "There is much yet to be done to connect this plane to the other.${{e1}}",
		    "fall_26.004": "%The Wizard is too deep in concentration to take notice of you.",
		    "fall_26.005": "...",
		    "fall_26.006": "This task taxes me. I will need to rest soon.${{e10}}",
		    "winter.000": "Sleep calls and yet refuses to take me.${{e10}}",
		    "spring.000": "Even I need fresh air sometimes.${{e1}}",
		    "marriage_Thu.000": "My heart.${{e1}}#$b#My tower seems empty compared to our home.${{e1}}#$b#But I cannot deny the benefits of working here, at times.${{e3}}",
		    "marriage_Thu.001": "Ah, @. Have you come to check on me?${{e1}}#$b#I'll be home, soon. Just after I finish one... last... thing...${{e3}}#$b#...${{e3}}#$b#What time is it?${{e10}}#$b#...I may have forgotten to eat lunch.${{e11}}",
		    "marriage_winter_17.000": "Ah, @. Have you met Iona?${{e1}}#$b#She's an excellent alchemist who travels the world alongside this crew and has seen many a thing or two.${{e3}}#$b#Just now she was describing her most recent expedition to the far north.${{e3}}",
		    "marriage_winter_17.001": "This is an impressive collection... Some of these trinkets could prove to be exceptionally useful for my rituals...#$b#How about you, my heart? Anything catch your eye?${{e1}}",
		    "marriage_winter_17.002": "Hmm?${{e3}}#$b#I'm just enjoying the view, would you like to join me?${{e1}}#$e#I'm... deeply grateful to have you in my life.#$b#You are no doubt tired of hearing it so much, I know. But I don't wish to ever take you for granted, not even for a second.#$b#I love you very much, @, never forget.${{e1}}#$e#I'll go home shortly, don't worry. I just... want to take in the moment for a while.${{e1}}",
		    "marriageExpecting_winter_17.002": "Hmm?${{e3}}#$b#I'm just enjoying the view, would you like to join me?${{e1}}#$e#I'm... deeply grateful to have you, and our future child, in my life.#$b#You are no doubt tired of hearing it so much, I know. But I don't wish to ever take you for granted, not even for a second.#$b#I love you very much, @, never forget.${{e1}}#$e#I'll go home shortly, don't worry. I just... want to take in the moment for a while.${{e1}}",
		    "NightMarket.000": "Greetings, @.#$b# I take it you're enjoying the night?#$b#I don't personally enjoy the market, but a wizard needs his stocks replenished too.${{e1}}",
		    "NightMarket.001": "These are rare finds indeed.${{e1}}",
		    "NightMarket.002": "The Night Market is good not only for trade of material goods, but knowledge as well.${{e1}}",
		    "NightMarket.003": "The merchandise is fully authentic don't you worry.#$b#That is, most of it at least.${{e1}}",
		    "NightMarket.004": "The Night Market is a rather new occasion in Pelican Town. It's a consequence of the war, many merchants are becoming more destitute and desperate by the day.#$b#I hope knowing that didn't spoil the mood for you.${{e2}}",
		    "NightMarket.005": "It's a good place for your holiday shopping.${{e1}}",
		    "NightMarket.006": "It's lovely to see you, @.${{e1}}#$b#May I ask we spend the Night Market together? Only if you don't mind, of course.${{e1}}#$b#Whats the proper term...${{e3}}#$b#...ehm...a date?${{e3}}",
		    "NightMarket.007": "Some of the merchandise on sale is quite potent. If used correctly it can be of great assistance to your farm.${{e3}}#$b#I can help you set it up if you decide to purchase any.${{e1}}",
		    "NightMarket.008": "Despite all the buzz of the night, the only thing I can think about is you and our upcoming wedding.${{e6}}",
		    "NightMarket.009": "I saw some gorgeous flowers in one of the stalls earlier. Perhaps we can purchase some for the occasion?${{e3}}",
		    "NightMarket.010": "I don't wish to speak with you today.",
		    "NightMarket.011": "%Magnus is ignoring you.",
		    // SVE Schedule Dialogue Edits
		    "marriage.000": "Here for a visit? You are welcome here, as always. My apologies if I'm a little distracted.${{e1}}",
		    "marriage.001": "If you wait just a moment, I'll let you take a taste of the potion I am working on! Nothing dangerous, I promise you.${{e9}}#$b#We're trying to perfect a recipe that provides long-lasting night vision.${{e1}}",
		    "marriage.002": "Oh, what a nice surprise! And good timing. I was about to disappear into a pile of books.${{e3}}",
		    "marriage.003": "You're the most welcome distraction I've had all day.${{e1}}#$b#Lewis makes some very strange requests sometimes...${{e10}}",
		    "marriage.004": "Ah, hello, @! You're welcome to stay while I work. I find your presence calming.${{e1}}",
		    "marriage.005": "It's always a pleasant surprise when you come to visit me at my tower. I trust your day is going well.${{e1}}",
		    "marriage.006": "I'm taking a break from teaching Morgan the next set of spells at the minute.#$b#They're performing very well in their lessons, but teaching magic wears me out a little.",
		    "marriage.007": "Today, I'm teaching Morgan a number of different spells to transform one kind of fruit into a different kind.#$b#We're both more than a little hungry.${{e3}}",
		    "marriage.008": "I have to keep reminding myself that Morgan is young. They have tremendous potential, but they need some time to grow into it.",
		    "marriage.009": "It's been a long few days collecting mushrooms in the forest, but Morgan and I finally get to do some experimenting with new potion recipes today.${{e1}}",
		    "marriage.010": "Morgan's potionmaking skills are coming along nicely. They mixed up an elixir of healing earlier that was just as good as anything I can produce.${{e1}}",
		    "marriage.011": "Today, Morgan and I are brewing a potion of luck. Hopefully they don't make the same mistake they did last time.${{e3}}#$b#They spent a week tripping over every branch in the forest, and I broke *two* of my favorite mirrors.${{e10}}",
		    "marriage.012": "Ah, I'm glad you stopped by! I wanted to let you know I might run late tonight.${{e3}}#$b#Today, Morgan and I have to take a trip deeper into the forest than usual for one of our lessons.",
		    "marriage.013": "Morgan and I are assessing the wards in the forest west of here today.",
		    "marriage.014": "I am just finishing up here, @! I'm looking forward to spending the evening with you.${{e1}}",
		    "marriage.015": "Just one more attempt at finishing this potion before I give up. At least it hasn't actually *exploded* yet.${{e10}}",
		    "marriage.016": "I will be home soon, I promise. I need to clean up a little around here first.#$b#I'm afraid that the more exciting magical research becomes, the more of a mess it makes.${{e1}}",
		    "marriage.017": "I do wish Camilla would call me by my name, instead of 'Razzy.' ...No, don't you dare.${{e10}}",
		    "marriage.018": "I haven't looked outside yet, but I hope Camilla took more care with where she landed this time.#$b#Last time I lost my favorite blackberry bush.${{e2}}"
            },
        },
        { //Olivia Dialogue
      	"Action": "EditData",
      	"Target": "Strings/Schedules/Wizard",
      	"When": { "Spouse |contains=Olivia, Wizard": false, "Relationship:Wizard |contains=Dating": false, "Hearts:Wizard": "0, 1, 2, 3, 4, 5, 6, 7", "Season |contains=Summer": true, "Day |contains=25": true },
      	"Entries": {
        	"OliviaVisitWhichTotallyIsNotWhatYouThinkItIs.001": "A-ah, @... would you be so kind to remove yourself from my abode?${{e3}}",
        	"OliviaVisitWhichTotallyIsNotWhatYouThinkItIs.002": "%He's sleeping.",
      		},
    	},
	]
}