{
	"Changes": [
		{ //Base
			"LogName": "Wizard's Unique Courtship Responses - Default",
			"Action": "EditData",
			"Target": "Characters/Dialogue/Wizard",
			"Entries": {
				"give_flowersA": "Ah! Is this...? For me...?${{e1}}#$b#Of course I feel the same!${{e7}}#$e#My heartbeat is fierce. How is yours?${{e6}}",
				"give_flowersB": "Ah! Is this...? For me...?${{e1}}#$b#Of course I feel the same!${{e7}}#$e#My heartbeat is fierce. How is yours?${{e6}}",
				"give_pendant": "...!!!${{e1}}#$b#@...!${{e6}}#$b#You truly wish to marry me?${{e6}}#$b#If that is true - somehow, impossibly true - then yes! Unequivocally, yes!!${{e6}}#$b#I will see to all the arrangements. Give me but three days, my love.${{e9}}",
				"stardrop_gift": "My heart, this fruit is for you. It has potent arcane energies to enhance your own.${{e4}}#$e#Let it be a symbol of my love.${{e4}}",
				"rejectNPCA": "Apologies, these flowers are useless to my studies. I advice you share them elsewhere.",
				"rejectNPCB": "I am not aware what you expect me to use these for. Please keep them to yourself.",
				"reject_two_heartA": "I was not aware you grew flowers on your farm. Are you planing to sell them?${{e3}}",
				"reject_two_heartB": "Is this species of flower not out of season? How have they been preserved so...${{e3}}",
				"reject_four_heartA": "If you are looking for a vase to place those in, I am afraid that all of mine are already in use.${{e3}}",
				"reject_four_heartB": "Do you not have plenty of water on your farm for those?${{e3}}",
				"engageA": "It is to my knowledge that you have already asked for anothers hand.#$b#If you believed I would accept, you have greviously misjudged my character.${{e5}}",
				"engageB": "If you would allow me to advise.#$b#You best return to your partner this instance, and shower them with the respect and sincerity they deserve.${{e5}} For you to even have the nerve to present me with this... Please leave immediately.${{e5}}",
				"marriedA": "I do not have even the slightest interest in entertaining such a thing with someone already wed.${{e5}}#$b#If you persist to treat people as mere toys, there will only be trouble on your path.${{e5}}",
				"marriedB": "It appears I have thoroughly misjudged your character, @.#$b#Please leave at once, and better yet, return to the one you have vowed your life to.${{e5}}#$b#Heed my words, if all my years in this life have taught me anything, it is that faithfulness is a virtue.${{e5}}",
				"refusal_knownA": "Are you truly so quick with your decisions, @.#$b#It is foolish to wed someone without truly having known them. Trust me I have made such mistakes before.",
				"refusal_knownB": "It is rather uncough to present me with this, no?#$b#I have already been married before, and do not wish to again. Please think twice before proposing to anyone.${{e10}}",
				"refusal_botherA": "You think I do not have ways of forcibly removing you from my tower? Please stop before it comes to such measures.${{e5}}",
				"refusal_botherB": "Was I not clear enough the first time?${{e5}}#$b#You have overstayed your welcome, farmer. Please leave at once.${{e5}}",
				"refusal_no_heartsA": "Did I accidentally mess up the potion you drank for the Junimos?${{e10}}#$b#I must decline, if you feel out of sorts, I advise you to sit with a chunk of clear quartz. It will help reverse... this... if it truly was my mistake.${{e11}}",
				"refusal_no_heartsB": "Hmm, this is an interesting sample. Are you aware the people of this valley use this to propose their intent to marry to another?${{e3}}#$b#I would store it safely if I were you. They can be hard to come by when you find yourself in need of one.${{e3}}",
				"birthdayLoveA": "...My birthday? Oh, it's that silly day again. Thank you nonetheless.${{e1}}",
				"birthdayLoveB": "A gift? For my birthday? My, these are potent materials indeed, thank you.${{e1}}",
				"birthdayLikeA": "For me? A birthday gift? Truly, I forgot my birthday today. Thank you.${{e9}}",
				"birthdayLikeB": "Seems you have a better memory than me. Thank you for the gift.${{e9}}",
				"birthdayDislikeA": "What's the purpose of this? Oh? Well... thank you.",
				"birthdayDislikeB": "A birthday gift? You didn't have to...really...${{e10}}",
				"birthdayNeutralA": "Oh, @. Ah...Thank you.",
				"birthdayNeutralB": "Oh? A birthday gift? I really appreciate it, thank you.${{e9}}",
				"giftquestion_yes": "Ah... I apologize for ever doubting you, my heart.${{e2}}#$b#Your honesty eases my soul, I thank you.${{e1}}",
				"giftquestion_lie": "Whether your gift giving has ulterior motives matters little, but your hesitancy to be forthright and truthful however...${{e2}}#$b#Do you fear I will misunderstand your words? I know my words are old-fashioned, however I will always ensure we are on the same page on matters of importance.#$b#It is important to me that we both agree to this mutual respect.",
				"baby_anxiety": "Much as I am eager to be a father, I cannot help but be apprehensive about the changes a child will bring to our lives...${{e2}}#$e#Swear to me that whatever comes, we will make the changes for the better.${{e1}}",
				"adopt_excitedA": "@, I completed the paperwork. Our child will arrive soon. Even speaking these words aloud, I can hardly believe it.${{e6}}",
				"adopt_excitedB": "@, I completed the paperwork. Our child will arrive soon. Even speaking these words aloud, I can hardly believe it.${{e6}}",
				"informPregnancyA": "@. Our child will arrive soon. Even speaking these words aloud, I can hardly believe it.${{e6}}",
				"informPregnancyB": "@. Our child will arrive soon. Even speaking these words aloud, I can hardly believe it.${{e6}}",
				"yourePregnantA": "@. Our child will arrive soon. Even speaking these words aloud, I can hardly believe it.${{e6}}",
				"yourePregnanyB": "@, I can sense the shift of the energies around you. You are pregnant!${{e7}}",
				"annoyedParent": "I love our children, truly... However today I feel my patience is being tested. It is reminding me of the wizardry exams from my youth.${{e10}}#$b#I may need to hide myself away in the tower for a day soon.${{e11}}",
				"aloneTime": "@. If I don't get a moment to myself I may strangle someone.${{e10}}#$e#Please. Just deal with the children, today.${{e10}}",
			},
		},
		{ //Dating, Engaged Gifts
			"LogName": "Wizard's Unique Courtship Responses - Dating/Engaged",
			"Action": "EditData",
			"Target": "Characters/Dialogue/Wizard",
			"When": {"Relationship:Wizard": "Dating, Engaged"},
			"Entries": {
				"give_flowersA": "Ah! @...${{e1}}#$b#Well this certainly takes me back. You did not have to gift these, but I appreciate the gesture none the less.${{e6}}",
				"give_flowersB": "Ah! @...${{e1}}#$b#Well this certainly takes me back. You did not have to gift these, but I appreciate the gesture none the less.${{e6}}",
				"birthdayLoveA": "...My birthday?${{e3}}#$b#My, what a thoughtful gift, however shall I repay you...${{e6}}",
				"birthdayLoveB": "A gift? For my birthday? You sure have gotten familiar with what is needed for my potions, thank you.${{e1}}",
				"birthdayLikeA": "For me? A birthday gift?${{e3}}#$b#Truly, I have forgotten it myself, but I can always count on you to remember. Thank you.${{e1}}",
				"birthdayLikeB": "You have always had the better memory, @. Thank you for the gift.${{e9}}",
				"birthdayDislikeA": "Ah...@... it is alright to forget my birthday.${{e10}}#$b#Your prescence rewards me enough.${{e1}}",
				"birthdayDislikeB": "Ah...@, be careful with that... I do not wish to see you get hurt.${{e10}}",
				"birthdayNeutralA": "For my birthday? Thank you, I appreciate it, @.${{e1}}",
				"birthdayNeutralB": "Mmm, is this for me? Thank you, @.${{e1}}",
			},
		},
		{ //Marriage Gifts
			"LogName": "Wizard's Unique Courtship Responses - Married",
			"Action": "EditData",
			"Target": "Characters/Dialogue/Wizard",
			"When": {"Relationship:Wizard": "Married"},
			"Entries": {
				"give_flowersA": "My heart.${{e6}}#$b#Thank you, my love. Shall we find a suitable vase? Where would you like to display them?${{e1}}",
				"give_flowersB": "My heart.${{e6}}#$b#Thank you, my love. Shall we find a suitable vase? Where would you like to display them?${{e1}}",
				"birthdayLoveA": "You never seem to forget today, hmm?${{e6}}#$b#Thank you my love. This, and you, are perfect.${{e1}}",
				"birthdayLoveB": "How did you know?${{e3}}#$b#This is perfect for my upcoming ritual this weekend.${{e1}}#$e#What is the ritual? That is for you to find out.${{e6}}",
				"birthdayLikeA": "Thank you, my heart. You always seem to know what I need most each time.${{e1}}",
				"birthdayLikeB": "My love, thank you.${{e1}}I could come up with a use for this or two...${{e4}}",
				"birthdayDislikeA": "Getting creative this year, are we, my heart?${{e3}}",
				"birthdayDislikeB": "I suppose this could challenge my usual ritual routines...$3{{e3}}",
				"birthdayNeutralA": "Any gift, if from you, exponentially increases in value. Thank you, my heart.${{e1}}",
				"birthdayNeutralB": "To think I used to forget my birthday before meeting you. Thank you, my love.${{e1}}",
			},
		},
	]
}